Ran Plan for dir: `deployment/cloud` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.tls_public_key.argocd_public_key will be read during apply
  # (config refers to values not yet known)
 <= data "tls_public_key" "argocd_public_key" {
      + algorithm                     = (known after apply)
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
    }

  # data.tls_public_key.atlantis_public_key will be read during apply
  # (config refers to values not yet known)
 <= data "tls_public_key" "atlantis_public_key" {
      + algorithm                     = (known after apply)
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
    }

  # tls_private_key.argocd_ssh will be created
+ resource "tls_private_key" "argocd_ssh" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.argocd.google_project_iam_member.sa_iam[0] will be created
+ resource "google_project_iam_member" "sa_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "fta-platform"
      + role    = "roles/container.admin"
    }

  # module.argocd.google_project_iam_member.sa_iam[1] will be created
+ resource "google_project_iam_member" "sa_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "fta-platform"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.argocd.google_service_account.gsa[0] will be created
+ resource "google_service_account" "gsa" {
      + account_id   = "fta-mstr-helm-argocd"
      + disabled     = false
      + display_name = "Service Account for helm fta-mstr-helm-argocd"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "fta-platform"
      + unique_id    = (known after apply)
    }

  # module.argocd.google_service_account_iam_binding.token_creator[0] will be created
+ resource "google_service_account_iam_binding" "token_creator" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:fta-platform.svc.id.goog[argocd/argocd-application-controller]",
          + "serviceAccount:fta-platform.svc.id.goog[argocd/argocd-repo-server]",
          + "serviceAccount:fta-platform.svc.id.goog[argocd/argocd-server]",
        ]
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

  # module.argocd.google_service_account_iam_binding.workload_identity_binding[0] will be created
+ resource "google_service_account_iam_binding" "workload_identity_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:fta-platform.svc.id.goog[argocd/argocd-application-controller]",
          + "serviceAccount:fta-platform.svc.id.goog[argocd/argocd-repo-server]",
          + "serviceAccount:fta-platform.svc.id.goog[argocd/argocd-server]",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.argocd.helm_release.helm will be created
+ resource "helm_release" "helm" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = true
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "fta-helm-argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (sensitive value)
      + verify                     = false
      + version                    = "7.5.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.argocd.kubernetes_namespace.namespace[0] will be created
+ resource "kubernetes_namespace" "namespace" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.gce_atlantis.google_compute_instance.instance will be updated in-place
~ resource "google_compute_instance" "instance" {
        id                   = "projects/fta-platform/zones/asia-southeast2-a/instances/fta-mstr-gce-atlantis"
      ~ metadata             = {
          - "ssh-keys" = <<-EOT
                atlantis:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCppPJxXdhuCczb0vJOXWb5ER6UBM0cNqB1ca51WPYUS8dc96Bv3FakPQ+CIusvH0GtaqfKau3IvGwAEnUGOkIuSYdtB8wf+V4YMt1mM8/CcsOQxGTuh73QpeeLkAlMDJ6JHXr0x9++NTiLCwaTuEZ1pcp1cr9jXK4tUvD/lLvpr34XAPsbWY9dDA9s2LbSl9XwKIAGB2AsKRkHqgXtiKAsiW4gHlcOPxxb5uLfZDRM0eK0cp9+RY3kHQZ7WTXSHl4mbg9EwUn2zmbmdiPiPpMVZsOFnHy9POwZXcMqoeCzqmvgDpJk75gtZEX0Gh20LIu5CPVK1trZKBDMYSdbJtCN
            EOT
        } -> (known after apply)
        name                 = "fta-mstr-gce-atlantis"
        tags                 = [
            "atlantis",
        ]
        # (20 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.gsm_iac.google_secret_manager_secret_version.secret_version must be replaced
-/+ resource "google_secret_manager_secret_version" "secret_version" {
      ~ create_time           = "2024-09-17T14:52:47.461175Z" -> (known after apply)
      + destroy_time          = (known after apply)
      ~ id                    = "projects/781497044301/secrets/iac/versions/8" -> (known after apply)
      ~ name                  = "projects/781497044301/secrets/iac/versions/8" -> (known after apply)
      ~ secret_data           = (sensitive value) # forces replacement
      ~ version               = "8" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.repo_gitops.github_repository_webhook.webhooks["argocd"] will be updated in-place
~ resource "github_repository_webhook" "webhooks" {
        id         = "502253815"
        # (4 unchanged attributes hidden)

      ~ configuration {
          ~ secret       = (sensitive value)
            # (3 unchanged attributes hidden)
        }
    }

  # module.repo_iac.github_repository_webhook.webhooks["atlantis"] will be updated in-place
~ resource "github_repository_webhook" "webhooks" {
        id         = "501983538"
        # (4 unchanged attributes hidden)

      ~ configuration {
          ~ secret       = (sensitive value)
            # (3 unchanged attributes hidden)
        }
    }

Plan: 9 to add, 3 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d deployment/cloud
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://fta-mstr-gce-atlantis:4141/lock?id=greyhats13%252Ffta_iac%252Fdeployment%252Fcloud%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d deployment/cloud
  ```
Plan: 9 to add, 3 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```